# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.Connection('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [6]:
#Your code here
c.execute('''select firstName, lastName 
from employees
join offices
using (officeCode)
where city = 'Boston';''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [28]:
#Your code here
c.execute('''select city,
count(employeeNumber) as num_employees
from offices
join employees
using (officeCode)
group by 1;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

            city  num_employees
0         Boston              2
1         London              2
2            NYC              2
3          Paris              5
4  San Francisco              6
5         Sydney              4
6          Tokyo              2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
How many products are there?
What is the most sold product?
Which customer spent the most money?

In [29]:
# Your code here
c.execute('''select count(productCode) as num_products
from products;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   num_products
0           110

In [36]:
# Your code here
c.execute('''select productName,
count(quantityOrdered) as num_ordered
from products
join orderdetails
using (productCode)
group by 1
order by num_ordered desc
limit 1;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

                   productName  num_ordered
0  1992 Ferrari 360 Spider red           53

In [38]:
# Your code here
c.execute('''select *,
sum(amount) as total_ordered
from customers
join payments
using (customerNumber)
group by 1
order by total_ordered desc
limit 1;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit,checkNumber,paymentDate,amount,total_ordered
0,141,Euro+ Shopping Channel,Freyre,Diego,(91) 555 94 44,"C/ Moralzarzal, 86",,Madrid,,28034,Spain,1370,227600.00,NU627706,2004-05-17,26155.91,715738.98

## Level Up: Display the names of each product each employee has sold

In [43]:
# Your code here
c.execute('''select productName,
salesRepEmployeeNumber
from products
join orderdetails
using (productCode)
join orders
using (orderNumber)
join customers
using (customerNumber)
group by 1
order by salesRepEmployeeNumber;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

                                 productName salesRepEmployeeNumber
0                     1928 Mercedes-Benz SSK                   1165
1  1938 Cadillac V-16 Presidential Limousine                   1165
2                      18th century schooner                   1216
3                          1903 Ford Model A                   1216
4                        1904 Buick Runabout                   1216

## Level Up: Display the Number of Products each employee has sold

In [46]:
#Your code here
c.execute('''select sum(quantityOrdered) as total_sold,
salesRepEmployeeNumber
from orderdetails
join orders
using (orderNumber)
join customers
using (customerNumber)
group by 2
order by salesRepEmployeeNumber;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

   total_sold salesRepEmployeeNumber
0       11854                   1165
1        4056                   1166
2        4227                   1188
3        5561                   1216
4        5016                   1286

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!